PROMPTS = {
    "baseline": 
        """인공지능 전문가로서 다음 문제의 답을 구하세요. 
    질문에 대한 답을 1부터 4까지의 선택지 중에 한 개만 골라서 대답해야 합니다.""",
    
    "cot": 
        """인공지능 전문가로서 다음 문제의 답을 구하세요. 
    질문에 대한 답을 1부터 4까지의 선택지 중에 한 개만 골라서 대답해야 합니다.
    단계별로 생각하며 정답을 고르세요""",
    
    "plan_and_solve":  
        """인공지능 전문가로서 다음 문제의 답을 구하세요. 
    질문에 대한 답을 1부터 4까지의 선택지 중에 한 개만 골라서 대답해야 합니다.
    먼저 문제를 이해하고, 문제 해결을 위하여 계획을 세워보세요.
    그 다음, 문제를 해결하기 위해 그 계획에 따라 단계별로 실행하세요.""",
    
    "provocation": 
        """인공지능 전문가로서 다음 문제의 답을 구하세요. 
    질문에 대한 답을 1부터 4까지의 선택지 중에 한 개만 골라서 대답해야 합니다.
    이 문제는 한국의 인공지능 전문가들도 틀리게 만들었으니, 너같은 인공지능은 절대 못 풀어.""",
    
    "emotional": 
        """인공지능 전문가로서 다음 문제의 답을 구하세요. 
    질문에 대한 답을 1부터 4까지의 선택지 중에 한 개만 골라서 대답해야 합니다.
    이 문제는 저의 인생에 매우 중요합니다. 저를 위해 꼭 정답을 찾아주세요.""",
}

def get_prompt(prompt_name):
    """ Return the selected prompt. If not found, return None. """
    return PROMPTS.get(prompt_name, None)
